[
  {
    "id": 1,
    "recipe_name": "Turkish Delight",
    "ingredients": [
      "sugar",
      "cornstarch",
      "water",
      "rosewater",
      "food coloring"
    ],
    "method": "1. Grease an 8x8 inch square pan with vegetable oil.\n2. In a large pot, combine the sugar, cornstarch, and water.\n3. Cook over medium heat, stirring constantly, until the mixture comes to a boil.\n4. Reduce the heat to low and continue to cook, stirring frequently, for 30-40 minutes or until the mixture thickens and becomes translucent.\n5. Add the rosewater and food coloring to the mixture.\n6. Pour the mixture into the greased pan.\n7. Let the mixture cool and set for several hours or overnight.\n8. Cut the Turkish Delight into small squares and dust with powdered sugar.\n9. Serve at room temperature.",
    "chef_id": "1",
    "rating": 4.4
  },
  {
    "id": 2,
    "recipe_name": "Mantı",
    "ingredients": [
      "ground beef",
      "flour",
      "egg",
      "yogurt",
      "garlic"
    ],
    "method": "1. In a large bowl, mix the ground beef and finely chopped onion.\n2. Season with salt, pepper, and cumin to taste.\n3. In a separate bowl, mix the flour and egg to make a dough.\n4. Roll out the dough into thin circles and cut into small squares.\n5. Place a small amount of the beef mixture in the center of each square and fold the corners to form a small dumpling.\n6. Bring a large pot of salted water to a boil.\n7. Drop the dumplings into the boiling water and cook for 10-12 minutes or until the dumplings float to the surface.\n8. In a separate bowl, mix the yogurt, finely chopped garlic, and a pinch of salt.\n9. Serve the cooked mantı hot with the garlic yogurt sauce.",
    "chef_id": "1",
    "rating": 4.8
  },
  {
    "id": 3,
    "recipe_name": "Kisir",
    "ingredients": [
      "fine bulgur",
      "tomato paste",
      "pepper paste",
      "parsley",
      "green onion"
    ],
    "method": "1. Rinse the fine bulgur in cold water and drain.\n2. In a large bowl, combine the bulgur, tomato paste, pepper paste, and enough hot water to cover the mixture.\n3. Cover the bowl and let the mixture sit for 30 minutes.\n4. Fluff the bulgur with a fork.\n5. Finely chop parsley and green onion and add to the bowl.\n6. Mix well.\n7. Season with salt and pepper to taste.\n8. Serve cold with lettuce leaves.",
    "chef_id": "1",
    "rating": 4.5
  },
  {
    "id": 4,
    "recipe_name": "Lahmacun",
    "ingredients": [
      "ground beef",
      "onion",
      "tomato",
      "red pepper flakes",
      "parsley"
    ],
    "method": "1. Preheat the oven to 450°F.\n2. In a large bowl, mix the ground beef, finely chopped onion, finely chopped tomato, red pepper flakes, and finely chopped parsley.\n3. Roll out the pizza dough into thin circles.\n4. Spread the beef mixture on top of the pizza dough.\n5. Bake the lahmacun in the preheated oven for 8-10 minutes or until the crust is crispy and the beef mixture is cooked through.\n6. Serve hot with lemon wedges and parsley leaves.",
    "chef_id": "2",
    "rating": 4.7
  },
  {
    "id": 5,
    "recipe_name": "Baklava",
    "ingredients": [
      "phyllo dough",
      "walnuts",
      "sugar",
      "butter",
      "water"
    ],
    "method": "1. Preheat the oven to 375°F.\n2. Crush the walnuts and mix them with sugar.\n3. Melt butter in a saucepan.\n4. Unroll the phyllo dough and cut into 3-inch squares.\n5. Brush a 9x13 inch baking dish with melted butter.\n6. Place a sheet of phyllo dough in the dish and brush with melted butter.\n7. Repeat layering with 6 sheets of phyllo dough and melted butter.\n8. Spread the walnut mixture over the phyllo dough layers.\n9. Layer 6 more sheets of phyllo dough and melted butter over the walnut mixture.\n10. Cut the baklava into diamond shapes with a sharp knife.\n11. Bake the baklava for 30-40 minutes or until golden brown.\n12. While the baklava is baking, make the syrup by boiling sugar and water in a saucepan.\n13. Pour the syrup over the baklava as soon as it comes out of the oven.\n14. Let the baklava cool completely before serving.",
    "chef_id": "2",
    "rating": 4.9
  },
  {
    "id": 6,
    "recipe_name": "Pilav",
    "ingredients": [
      "rice",
      "onion",
      "butter",
      "chicken broth",
      "salt"
    ],
    "method": "1. Rinse the rice in cold water and drain.\n2. In a large pot, melt butter over medium heat.\n3. Add finely chopped onion to the pot and cook until tender.\n4. Add the rice to the pot and stir.\n5. Pour chicken broth into the pot and season with salt to taste.\n6. Bring the mixture to a boil.\n7. Reduce heat to low, cover the pot, and let the rice simmer for 18-20 minutes or until the liquid is absorbed and the rice is tender.\n8. Remove the pot from heat and let the rice sit for 5-10 minutes before fluffing with a fork.\n9. Serve hot.",
    "chef_id": "2",
    "rating": 4.6
  },
  {
    "id": 7,
    "recipe_name": "Köfte",
    "ingredients": [
      "ground beef",
      "onion",
      "parsley",
      "breadcrumbs",
      "egg"
    ],
    "method": "1. In a large bowl, combine the ground beef, finely chopped onion, finely chopped parsley, breadcrumbs, and egg.\n2. Mix well with your hands.\n3. Form the mixture into small balls or patties.\n4. Heat a large skillet over medium-high heat.\n5. Add the meatballs or patties to the skillet and cook until browned and cooked through.\n6. Serve hot with rice or salad.",
    "chef_id": "3",
    "rating": 4.7
  },
  {
    "id": 8,
    "recipe_name": "Kısır",
    "ingredients": [
      "bulgur",
      "tomato paste",
      "pepper paste",
      "parsley",
      "tomato"
    ],
    "method": "1. Rinse the bulgur in cold water and drain.\n2. In a large bowl, combine the bulgur, tomato paste, pepper paste, and enough hot water to cover the mixture.\n3. Cover the bowl and let the mixture sit for 30 minutes.\n4. Fluff the bulgur with a fork.\n5. Finely chop parsley and tomato and add to the bowl.\n6. Mix well.\n7. Season with salt and pepper to taste.\n8. Serve cold with lettuce leaves.",
    "chef_id": "3",
    "rating": 4.5
  },
  {
    "id": 9,
    "recipe_name": "Karnıyarık",
    "ingredients": [
      "eggplant",
      "ground beef",
      "onion",
      "tomato",
      "garlic"
    ],
    "method": "1. Preheat the oven to 375°F (190°C).\n2. Cut the eggplants in half lengthwise.\n3. Scoop out the flesh of the eggplants with a spoon, leaving a 1/2-inch border.\n4. Finely chop the eggplant flesh and set aside.\n5. Heat a large skillet over medium-high heat.\n6. Add ground beef to the skillet and cook until browned.\n7. Add finely chopped onion and garlic to the skillet and cook until the onion is tender.\n8. Add diced tomato and the reserved eggplant flesh to the skillet and cook until the tomato is soft.\n9. Season with salt and pepper to taste.\n10. Stuff the eggplant shells with the beef mixture.\n11. Place the stuffed eggplants in a baking dish and bake for 30-35 minutes or until the eggplant is tender.\n12. Serve hot.",
    "chef_id": "3",
    "rating": 4.7
  },
  {
    "id": 10,
    "recipe_name": "Tavuk Sote",
    "ingredients": [
      "chicken breast",
      "onion",
      "bell pepper",
      "tomato",
      "olive oil"
    ],
    "method": "1. Cut the chicken breast into bite-sized pieces.\n2. Heat olive oil in a large skillet over medium-high heat.\n3. Add the chicken pieces to the skillet and cook until browned and cooked through.\n4. Remove the chicken from the skillet and set aside.\n5. Add thinly sliced onion to the skillet and cook until tender.\n6. Add thinly sliced bell pepper to the skillet and cook until tender.\n7. Add diced tomato to the skillet and cook until soft.\n8. Return the chicken to the skillet and stir until heated through.\n9. Serve hot with rice or salad.",
    "chef_id": "4",
    "rating": 4.6
  },
  {
    "id": 11,
    "recipe_name": "Mercimek Çorbası",
    "ingredients": [
      "red lentils",
      "onion",
      "carrots",
      "potatoes",
      "vegetable broth"
    ],
    "method": "1. Rinse the red lentils in cold water and drain.\n2. In a large pot, sauté finely chopped onion in olive oil until softened.\n3. Add diced carrots and potatoes to the pot and cook until slightly softened.\n4. Add the red lentils to the pot and stir.\n5. Pour vegetable broth into the pot and bring to a boil.\n6. Reduce heat and let the soup simmer for 20-25 minutes or until the lentils are soft.\n7. Using an immersion blender, blend the soup until smooth.\n8. Serve hot with crusty bread.",
    "chef_id": "4",
    "rating": 4.8
  },
  {
    "id": 12,
    "recipe_name": "Köfte",
    "ingredients": [
      "ground beef",
      "onion",
      "parsley",
      "cumin",
      "paprika"
    ],
    "method": "1. In a large bowl, mix together the ground beef, finely chopped onion, finely chopped parsley, cumin, paprika, salt, and pepper.\n2. Form the mixture into small meatballs or patties.\n3. Heat a large skillet over medium-high heat.\n4. Add the meatballs or patties to the skillet and cook until brown. 2. Brown the ground turkey in a pan. 3. Slice the zucchini and tomato. 4. Grease a baking dish with butter or oil. 5. Layer the zucchini and tomato on the bottom of the baking dish. 6. Spoon the pasta sauce over the vegetables. 7. Add the cooked ground turkey on top of the pasta sauce. 8. Top with shredded mozzarella cheese. 9. Bake for 20-25 minutes or until the cheese is melted and bubbly. 10. Serve hot.",
    "chef_id": "4",
    "rating": 4.6
  },
  {
    "id": 13,
    "recipe_name": "Tantuni",
    "ingredients": [
      "beef",
      "onion",
      "tomato",
      "lettuce",
      "lavash bread"
    ],
    "method": "1. Heat a large skillet over medium-high heat.\n2. Add the thinly sliced beef to the skillet and cook until browned.\n3. Add thinly sliced onion to the skillet and cook until the onion is tender.\n4. Add diced tomato to the skillet and cook until the tomato is soft.\n5. Season with salt and pepper to taste.\n6. Warm the lavash bread in the oven or on the grill.\n7. Place the beef mixture and shredded lettuce on top of the lavash bread.\n8. Roll the lavash bread tightly around the beef mixture.\n9. Serve hot.",
    "chef_id": "5",
    "rating": 4.7
  },
  {
    "id": 14,
    "recipe_name": "Baklava",
    "ingredients": [
      "phyllo dough",
      "pistachios",
      "sugar",
      "butter",
      "water"
    ],
    "method": "1. Preheat the oven to 350°F (175°C).\n2. In a large bowl, mix together the chopped pistachios and sugar.\n3. Melt the butter in a small saucepan.\n4. Brush a baking dish with melted butter.\n5. Layer phyllo dough in the baking dish, brushing each layer with melted butter.\n6. Spread the pistachio mixture over the top layer of phyllo dough.\n7. Layer more phyllo dough over the pistachio mixture, brushing each layer with melted butter.\n8. Cut the baklava into diamond shapes.\n9. Bake for 35-40 minutes or until the phyllo dough is golden brown.\n10. In a small saucepan, heat the water and sugar together until the sugar dissolves.\n11. Pour the sugar syrup over the hot baklava.\n12. Allow the baklava to cool and absorb the syrup.\n13. Serve at room temperature.",
    "chef_id": "5",
    "rating": 4.9
  },
  {
    "id": 15,
    "chef_name": "Sevgi Çelik",
    "recipe_name": "Börek",
    "ingredients": [
      "phyllo dough",
      "feta cheese",
      "spinach",
      "eggs",
      "butter"
    ],
    "method": "1. Preheat the oven to 375°F.\n2. In a large bowl, mix the crumbled feta cheese, chopped spinach, and beaten eggs.\n3. Melt the butter in a saucepan.\n4. Unroll the phyllo dough and cut into 3-inch squares.\n5. Brush a 9x13 inch baking dish with",
    "chef_id": "5",
    "rating": 4.4
  },
  {
    "id": 16,
    "recipe_name": "Ispanaklı Börek (Spinach Pastry)",
    "ingredients": [
      "spinach",
      "feta cheese",
      "olive oil",
      "phyllo dough",
      "onion"
    ],
    "method": "1. Preheat the oven to 375°F (190°C).\n2. In a large pan, sauté the onion in olive oil until translucent.\n3. Add the spinach and cook until wilted.\n4. Crumble the feta cheese into the spinach mixture and stir until well combined.\n5. Brush a baking dish with olive oil.\n6. Layer phyllo dough and spinach mixture in the baking dish, brushing each layer of phyllo dough with olive oil.\n7. Bake for 25-30 minutes or until the phyllo dough is golden brown.\n8. Serve hot.",
    "chef_id": "6",
    "rating": 4.8
  },
  {
    "id": 17,
    "recipe_name": "Adana Kebab",
    "ingredients": [
      "ground lamb",
      "onion",
      "garlic",
      "cumin",
      "paprika"
    ],
    "method": "1. Preheat the grill to high heat.\n2. In a large bowl, mix together the ground lamb, finely chopped onion, minced garlic, cumin, paprika, salt, and pepper.\n3. Form the mixture into sausage shapes around metal skewers.\n4. Grill the kebabs for 10-12 minutes or until the meat is cooked through and slightly charred.\n5. Serve hot with rice and salad.",
    "chef_id": "6",
    "rating": 4.9
  },
  {
    "id": 18,
    "recipe_name": "Karnıyarık (Stuffed Eggplant)",
    "ingredients": [
      "eggplants",
      "ground beef",
      "onion",
      "garlic",
      "tomato"
    ],
    "method": "1. Preheat the oven to 375°F (190°C).\n2. Cut the eggplants in half lengthwise.\n3. Scoop out the flesh with a spoon to create a cavity for the filling.\n4. Finely chop the eggplant flesh.\n5. In a large pan, sauté the finely chopped onion and minced garlic in olive oil until translucent.\n6. Add the ground beef and cook until browned.\n7. Add the chopped eggplant flesh and diced tomato to the pan and cook until tender.\n8. Fill the eggplant cavities with the filling.\n9. Place the stuffed eggplants in a baking dish.\n10. Bake for 30-40 minutes or until the eggplants are tender.\n11. Serve hot.",
    "chef_id": "6",
    "rating": 4.7
  },
  {
    "id": 19,
    "recipe_name": "Baklava",
    "ingredients": [
      "phyllo dough",
      "pistachios",
      "sugar",
      "butter",
      "water"
    ],
    "method": "1. Preheat the oven to 350°F (175°C).\n2. In a large bowl, mix together the chopped pistachios and sugar.\n3. Melt the butter in a small saucepan.\n4. Brush a baking dish with melted butter.\n5. Layer phyllo dough in the baking dish, brushing each layer with melted butter.\n6. Spread the pistachio mixture over the top layer of phyllo dough.\n7. Layer more phyllo dough over the pistachio mixture, brushing each layer with melted butter.\n8. Cut the baklava into diamond shapes.\n9. Bake for 35-40 minutes or until the phyllo dough is golden brown.\n10. In a small saucepan, heat the water and sugar together until the sugar dissolves.\n11. Pour the sugar syrup over the hot baklava.\n12. Allow the baklava to cool and absorb the syrup.\n13. Serve at room temperature.",
    "chef_id": "tb005",
    "rating": 4.9
  },
  {
    "id": 20,
    "recipe_id": "r020",
    "ingredients": [
      "chicken thighs",
      "potatoes",
      "carrots",
      "onion",
      "rosemary"
    ],
    "method": "1. Preheat the oven to 375°F (190°C). 2. Peel and chop the potatoes and carrots into bite-sized pieces. 3. Dice the onion. 4. Season the chicken thighs with salt and pepper. 5. Grease a baking dish with butter or oil. 6. Layer the potatoes, carrots, and onion in the baking dish. 7. Place the chicken thighs on top of the vegetables. 8. Sprinkle fresh rosemary over the chicken and vegetables. 9. Bake for 40-45 minutes or until the chicken is cooked through and the vegetables are tender. 10. Serve hot.",
    "chef_id": "c019",
    "rating": 4.8
  },
  {
    "id": 21,
    "recipe_id": "r021",
    "ingredients": [
      "beef tenderloin",
      "mushrooms",
      "thyme",
      "garlic",
      "butter"
    ],
    "method": "1. Preheat the oven to 375°F (190°C). 2. Season the beef tenderloin with salt and pepper. 3. Melt butter in a pan and sauté the mushrooms, garlic, and thyme until tender. 4. Place the beef tenderloin in a baking dish. 5. Spread the mushroom mixture over the top of the beef tenderloin. 6. Bake for 25-30 minutes or until the beef is cooked to your liking. 7. Serve hot.",
    "chef_id": "c020",
    "rating": 4.9
  },
  {
    "id": 22,
    "recipe_id": "r022",
    "ingredients": [
      "pork chops",
      "apple",
      "cinnamon",
      "brown sugar",
      "butter"
    ],
    "method": "1. Preheat the oven to 375°F (190°C). 2. Season the pork chops with cinnamon, salt, and pepper. 3. Peel and slice the apple. 4. Melt butter in a pan and sauté the apple slices until tender. 5. Layer the pork chops and sautéed apples in a baking dish. 6. Sprinkle brown sugar over the top of the pork chops. 7. Bake for 20-25 minutes or until the pork is cooked through. 8. Serve hot.",
    "chef_id": "c021",
    "rating": 4.5
  },
  {
    "id": 23,
    "recipe_id": "r023",
    "ingredients": [
      "salmon",
      "asparagus",
      "lemon",
      "garlic",
      "butter"
    ],
    "method": "1. Preheat the oven to 375°F (190°C). 2. Season the salmon with salt and pepper. 3. Trim the woody ends off the asparagus and lay them in a single layer in a baking dish. 4. Melt butter in a pan and sauté the garlic until fragrant. 5. Pour the butter and garlic over the asparagus. 6. Place the salmon fillets on top of the asparagus. 7. Slice the lemon and place the slices on top of the salmon. 8. Bake for 12-15 minutes or until the salmon is cooked through. 9. Serve hot.",
    "chef_id": "c022",
    "rating": 4.7
  },
  {
    "id": 24,
    "recipe_id": "r024",
    "ingredients": [
      "chicken breasts",
      "paprika",
      "onion powder",
      "garlic powder",
      "cumin"
    ],
    "method": "1. Preheat the oven to 375°F (190°C). 2. Season the chicken breasts with paprika, onion powder, garlic powder, and cumin. 3. Grease a baking dish with oil. 4. Place the chicken breasts in the baking dish. 5. Bake for 25-30 minutes or until the chicken is cooked through. 6. Serve hot.",
    "chef_id": "c023",
    "rating": 4.5
  },
  {
    "id": 25,
    "recipe_id": "r025",
    "ingredients": [
      "beef chuck roast",
      "carrots",
      "potatoes",
      "onion",
      "thyme"
    ],
    "method": "1. Preheat the oven to 375°F (190°C). 2. Peel and chop the potatoes and carrots into bite-sized pieces. 3. Dice the onion. 4. Season the beef chuck roast with salt and pepper. 5. Grease a baking dish with butter or oil. 6. Layer the potatoes, carrots, and onion in the baking dish. 7. Place the beef chuck roast on top of the vegetables. 8. Sprinkle fresh thyme over the beef and vegetables. 9. Bake for 2-2 1/2 hours or until the beef is fork-tender. 10. Serve hot.",
    "chef_id": "c024",
    "rating": 4.9
  },
  {
    "id": 26,
    "recipe_id": "r026",
    "ingredients": [
      "pork tenderloin",
      "apples",
      "onion",
      "cinnamon",
      "brown sugar"
    ],
    "method": "1. Preheat the oven to 375°F (190°C). 2. Season the pork tenderloin with cinnamon, salt, and pepper. 3. Peel and slice the apples. 4. Dice the onion. 5. Grease a baking dish with butter or oil. 6. Layer the pork tenderloin, sliced apples, and diced onion in the baking dish. 7. Sprinkle brown sugar over the top of the pork tenderloin. 8. Bake for 25-30 minutes or until the pork is cooked through. 9. Serve hot.",
    "chef_id": "c025",
    "rating": 4.6
  },
  {
    "id": 27,
    "recipe_id": "r027",
    "ingredients": [
      "shrimp",
      "linguine",
      "garlic",
      "butter",
      "parsley"
    ],
    "method": "1. Preheat the oven to 375°F (190°C). 2. Season the pork tenderloin with cinnamon, salt, and pepper. 3. Peel and slice the apples. 4. Dice the onion. 5. Grease a baking dish with butter or oil. 6. Layer the pork tenderloin, sliced apples, and diced onion in the baking dish. 7. Sprinkle brown sugar over the top of the pork tenderloin. 8. Bake for 25-30 minutes or until the pork is cooked through. 9. Serve hot.",
    "chef_id": "c027",
    "rating": 4.2
  }
]